function [t1,t2]=inverse(x,y,x0,y0,l1,l2)
  % Розрахунок зворотної кінематики робота
  % Вхідні параметри:
  % x,y - очікуване положення робочого сегменту робота
  % x0,y0 - положення місця кріплення основи робота
  % l1,l2 - довжини сегментів
  % Вихідні параметри:
  % t1,t2 - кути відхилення сегментів (градуси)

  t1=0; % Необхідно визначити вираз
  t2=0; % Необхідно визначити вираз

  % Перевірка на допустимість результату
  if iscomplex(t2)
    error(["Bad value t2 :",num2str(t2)]);
  endif

  if iscomplex(t1)
    error(["Bad value t1 :",num2str(t1)]);
  endif

endfunction
