function [x,y]=realrobot(x0,y0,t1,t2,l1,l2)
  % Виконати конструювання матриць трансформації
  % двосегментного робота маніпулятора та
  % відтворити координати пооження його сегментів
  % у вигляді векторів x,y, де
  % x = [x0, s1_x, s2_x], y = [y0, s1_y, s2_y]

  % Сегмент 1:
  % Матриця повороту - потрібно скласти
  % при складанні користватися
  % тригонометричними фукнціями у градусах!
  % cosd(), sind();
    R1 = eye(2);
    R1T = R1; % кінцева матриця
  % Положення - потрібно скласти
    d1 = [x0;y0];
  % Матриця гомогенної трансформації
    T1 = [R1T,d1;[0,0],1];
  % Положення виходу
    s1 = T1*[l1;0;1];
    s1_x = s1(1);
    s1_y = s1(2);

  % Сегмент 1:
  % Матриця повороту - потрібно скласти
    R2 = eye(2);
    R2T = R2;
  % Положення - потрібно скласти
    d2 = [x0+l1;y0];
  % Матриця гомогенної трансформації
    T2 = [R2T,d2;[0,0],1];
  % Положення виходу
    s2 = T2*[l2;0;1];
    s2_x = s2(1);
    s2_y = s2(2);

  x = [x0, s1_x, s2_x];
  y = [y0, s1_y, s2_y];
endfunction
